app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["course_name", "course 1"], ["created_at", "2022-12-21 13:13:09.683268"], ["updated_at", "2022-12-21 13:13:09.683268"]]
---
  def create
    course = Course.new(permit_course_params)
    response = if course.save

SELECT COUNT(*) FROM "courses"
SELECT "courses".* FROM "courses" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "tutors".* FROM "tutors" WHERE "tutors"."course_id" = $1  [["course_id", 4]]
---
  def list
    permitted_params = permit_course_params
    page = permitted_params[:page]&.to_i
    per_page = permitted_params[:per_page]&.to_i
    courses = []
    total_courses = Course.count
    Course.limit(per_page).offset(page).includes(:tutors).map do |course|