app/controllers/tutors_controller.rb

INSERT INTO "tutors" ("tutor_name", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tutor_name", "tutor 1"], ["course_id", 2], ["created_at", "2022-12-21 13:21:21.083632"], ["updated_at", "2022-12-21 13:21:21.083632"]]
---
  def create
    tutor = @course.tutors.build(permit_tutor_params)
    response = if tutor.save

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_course
    @course = Course.find_by(id: params[:course_id])